src/cf/Documents/вогРаспределениеDIYПоНоменклатурнымГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>вогРаспределениеDIYПоНоменклатурнымГруппам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.вогРаспределениеDIYПоНоменклатурнымГруппам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеDIY</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоШахты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБереза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУфа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПечоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКерамин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/вогРаспределениеDIYПоНоменклатурнымГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогРаспределениеDIYПоНоменклатурнымГруппам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/вогРаспределениеDIYПоНоменклатурнымГруппам/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Записывать = Истина;
	
	НГБерезы 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("23f84ea5-6868-11e7-9071-005056acd97c"));
	НГПечоры 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("75e9b0e1-ec17-11e5-b10e-005056acd97c"));
	НГУфа 		= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("08fced4f-9215-11e3-ba76-005056ac259f"));
	НГШахты 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("ee883a10-6867-11e7-9071-005056acd97c"));
	НГКерамин 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("c086e912-43d3-11e8-8a33-005056acd97c"));
	НГИК 		= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("0298e138-2a43-11eb-abef-005056bcd3e3"));
	
	Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Ответственный.Подразделение);
	
	// ++ VOG Солодов В.В. 24.03.2021 DEV-260
	СоответствиеНГ = Новый Соответствие;
	СоответствиеНГ.Вставить("КоличествоБереза", 	НГБерезы);
	СоответствиеНГ.Вставить("КоличествоПечоры", 	НГПечоры);
	СоответствиеНГ.Вставить("КоличествоУфа", 		НГУфа);
	СоответствиеНГ.Вставить("КоличествоШахты", 		НГШахты);
	СоответствиеНГ.Вставить("КоличествоКерамин", 	НГКерамин);
	СоответствиеНГ.Вставить("КоличествоИК", 		НГИК);
	
	Для Каждого Строка Из РаспределениеDIY Цикл
		
		Для Каждого КлючИЗначение Из СоответствиеНГ Цикл
			
			НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
			НоваяЗапись.Период 					= Дата;
			НоваяЗапись.Регистратор 			= Ссылка;
			НоваяЗапись.Клиент 					= Строка.Клиент;
			НоваяЗапись.НоменклатурнаяГруппа 	= КлючИЗначение.Значение;
			НоваяЗапись.Подразделение 			= Подразделение;
			НоваяЗапись.КоличествоПлан 			= Строка[КлючИЗначение.Ключ];
			
			НоваяЗапись.СценарийПланирования 	= СценарийПланирования;
			НоваяЗапись.ВерсияСценария 			= ВерсияСценария;
			НоваяЗапись.ПериодПланирования 		= ПериодПланирования;
			
		КонецЦикла;
		
	КонецЦикла;
	// До изменения
	//Для Каждого Строка Из РаспределениеDIY Цикл
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГБерезы;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоБереза;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГПечоры;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоПечоры;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГУфа;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоУфа;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГШахты;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоШахты;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГКерамин;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоКерамин;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГИК;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоИК;
	//	
	//КонецЦикла;
	// -- VOG Солодов В.В. 24.03.2021 DEV-260
	
КонецПроцедуры

#КонецОбласти
